# ------------------------------------------------------------
# 복습문제
# ------------------------------------------------------------
# [1] "010-1111-2222" 데이터에서 '-'를 제외한 데이터만 화면에 출력
phone = "010-1111-2222"
print(phone[0:3]+phone[4:8]+phone[9:13])
print(phone[0:3],phone[4:8],phone[9:13])
#print(phone[0:phone.rindex('1')+1])

# [2] "홀짝홀짝홀짝" 데이터에서 '홀'만 화면에 출력
holjjac = "홀짝홀짝홀짝"
print(holjjac[::2])

holjjac2 = holjjac[::2]
print(holjjac2, len(holjjac2))
print(holjjac[0], len(holjjac[0]))


# [3] 아래와 같이 출력되도록 출력
#       연산자 활용 ... 이게 맞나 ?
# ================================  
# HAPPY NEW YEAR
# ================================

msg = "HAPPY NEW YEAR"
msg2 = "="
print(f"{msg2*20}\n{'{:^20}'.format(msg)}\n{msg2*20}")
print(f"{'='*20}\n{'{:^20}'.format(msg)}\n{'='*20}")

# [4] "123456789012345678901234567890"에서 값이 짝수인 데이터만 화면에 출력
num = "123456789012345678901234567890"
print(num[1::2])

# [5] "240101-3234567" 주민번호에서 뒷자리만 출력
num01 = "240101-3234567"
print(num01[-7:])