# ------------------------------------------------------------------ 
# 변수 살펴보기
# 변수란?
#  (1) 데이터를 저장하고 있는 메모리 공간의 이름
#  (2) 데이터가 저장된 주소를 저장하고 있는 메모리 공간의 이름
# 파이썬 데이터 저장 방식 ==> (2)방식
# 문법 : 변수명 = 데이터
# ------------------------------------------------------------------ 
# 숫자 2024에 저장
year = 2024

# 나이 21세를 메모리에 저장

# 나이를 22세로 변경 저장
# [깃털] = 22
age = 20
oberder = 20



#[2024년 6월 26일 수요일 과제]
# 1. 6개월 뒤에 하고 싶은 일 AI, 인공지능 관련 & 공부 계획
""" 
- 데이터 분석
  1. 게임 데이터 분석
  2. 소설 데이터, 알고리즘 관련

= 개발자보다는 데이터 추출 및 취합 분류하는 쪽 희망.
"""
# 2. 자기 자신에 대한 분석 =? 장점/ 단점/ 개선
"""
1. (장점) 무언가에 꽂히면 미친듯이 파고들고 열심히 함. <-> (단점) 꽂힌 일에만 몰두하게 됨. 
    = (개선점) 적당히 타협보고 미련을 버릴 줄 알아야한다.

2. (단점) 멘탈이 약하다. -> (장점) 낙관적인 성격 때문에 금방 회복한다
    -> (단점) 중요한 일에도 낙관적인 성격때문에 오만하게 생각하는 경우가 있다. 
    = (필요 개선) 낙관적인 성격을 살려 평정심을 유지하도록 노력한다. 무엇을 하든 그것을 쉽게 보지 않도록 겸손한 자세를 취해야한다.

3. (단점) 게으르고 미루는 일이 잦다.
    = (필요 개선) 생활패턴부터 바꿔야한다.

4. 
    
"""
# 3. 이력서 작성
"""
24.02.28 계명대학교 컴퓨터 공학과 졸업
22.1 ~ 22.7 (주)착한형님 근무

자격증  
1. 2022 운전면허 2종보통 
2. CAD 실무능력평가 2019.03.09  1급     KPC한국생산성본부
"""