# ------------------------------------------------------------------
# 내가 만든 함수들
# ------------------------------------------------------------------
def add(num1, num2):
    return num1+num2

print(f"__name__ : {__name__}")



if __name__ == " __main__":
    print("--TEST--")
    print(f"결과 : {add(100,100)}")

    """
    파일 name 매직코드가 있는데 파이선에서 이 __ __ 네가 메인이야! 넣어줌
    이제는 b에서 a를 임포트 해놧어. 그럼 메인은 b.
    그럼 a의 코드가 다 실행이 되는데.
    __ __에 주인공인 a의 자리를 넣었어야ㅐㅎ.

    ???? 먼 개소리고.

    __ __ 쓰면 지가 주인공이 아닌 파일에서 안돌아가는? 것 같은데.


    월요일 오전 오후 프로젝트 해야했음.

    강의 진행할 예정
    화 오후 프로그램 만들기
    발표 : 수 오전

    데이터 파일에 저장.
    그 파일에서 정보 가져올 수 잇고



    
    """