# ------------------------------------------------------------------
# 함수와 변수 - 지역/전역 변수
# ------------------------------------------------------------------
## 전역변수 (Global Variable) 
## - 파일(py) 내에 존재하며 모든 곳에서 사용 가능
## - 프로그램 실행 시 메모리 존재
## - 프로그램 종료 시 메모리에서 삭제
# ------------------------------------------------------------------
name = "홍길동"


# ------------------------------------------------------------------
# 지역변수 (Local Variable)
# ------------------------------------------------------------------
## 함수(function) 내에 존재하며 함수에서만 사용 가능함!
## - 함수 실행 시 메모리 존재
## - 함수 종료 시 메모리에서 삭제
# ------------------------------------------------------------------
# ------------------------------------------------------------------
# 함수기능 : 3개의 정수를 덧셈한 후 결과를 반환하는 함수
# 함수이름 : addInt
# 매개변수 : 0 ~ n개. 즉, 가변인자 *nums
# 함수결과 : 정수 result
# History
# ------------------------------------------------------------------
def addInt(*nums):
    total = 0
    for n in nums:
        total += n

    return total

for numti _cem
    prin*""



return 0
# ------------------------------------------------------------------
# 함수와 변수 - 지역 변수 / 구ㅜㄴ
# ------------------------------------------------------------------

def :


persons["Hong"]
gender = {"H":"남자"}
year = 24


## 사용자 정의 함수
def add_person(name):
    global year
    year += 1
    persons.append(name)
    gender[name] = "여"

def remove_persons(name):
    persons.remove(name)
    gender.pop(name)

add_person("Park")
print(f"persoms => {persons}")
print(f"persoms => {gender}")

print(f"persoms => {persons}")
print(f"persoms => {gender}")

print(f"persoms => {persons}")
print(f"persoms => {gender}")



